test/logs/k6_logs.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /Users/ramantehlan/Workspace/go/src/github.com/truefoundry/elasti/test/load.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 141 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 147 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 167 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 177 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 216 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 225 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 235 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 243 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 252 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 262 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 272 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 282 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 292 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 302 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 311 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 321 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 360 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 369 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 379 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 389 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 398 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 408 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 418 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 425 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 435 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 445 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 455 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 465 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 475 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 484 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s

     ✓ status was 200

     checks.........................: 100.00% ✓ 1482      ✗ 0   
     data_received..................: 3.2 MB  52 kB/s
     data_sent......................: 90 kB   1.5 kB/s
     failed_requests_1..............: 0.00%   ✓ 0         ✗ 494 
     failed_requests_2..............: 0.00%   ✓ 0         ✗ 494 
     failed_requests_3..............: 0.00%   ✓ 0         ✗ 494 
     http_req_blocked...............: avg=8.58ms   min=0s       med=1µs      max=1.09s    p(90)=2µs      p(95)=2µs     
     http_req_connecting............: avg=1.73ms   min=0s       med=0s       max=90.93ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=399.01ms min=324.43ms med=342.38ms max=2.74s    p(90)=366.48ms p(95)=431.79ms
       { expected_response:true }...: avg=399.01ms min=324.43ms med=342.38ms max=2.74s    p(90)=366.48ms p(95)=431.79ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1482
     http_req_receiving.............: avg=1.19ms   min=10µs     med=149µs    max=55.32ms  p(90)=2.82ms   p(95)=5.09ms  
     http_req_sending...............: avg=137.37µs min=13µs     med=133µs    max=2.12ms   p(90)=218µs    p(95)=252.89µs
     http_req_tls_handshaking.......: avg=6.14ms   min=0s       med=0s       max=958.39ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=397.67ms min=323.69ms med=341.41ms max=2.73s    p(90)=364.03ms p(95)=427.54ms
     http_reqs......................: 1482    24.323615/s
     iteration_duration.............: avg=1.22s    min=990.21ms med=1.03s    max=9.35s    p(90)=1.13s    p(95)=1.28s   
     iterations.....................: 494     8.107872/s
     vus............................: 10      min=10      max=10
     vus_max........................: 10      min=10      max=10


running (1m00.9s), 00/10 VUs, 494 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s